[
  {
    "id": "VAAPEE_DOUBLE_45K",
    "description": "The Vaapee Double 45K is a cutting-edge rechargeable disposable vape engineered for ultimate convenience, longevity, and flavor variety, delivering an impressive up to 45,000 puffs in a single compact device.\nKey Features:\n\nDouble Flavor System — Enjoy two distinct, premium flavors in one device, with a simple switch mechanism that lets you effortlessly alternate between them whenever your mood changes—no need for multiple vapes.\nDual Mesh Coil — Powered by advanced dual mesh coils (and dual core processing), it ensures even heating, richer vapor production, intense flavor consistency, and smoother draws from the first puff to the last, minimizing dry hits and maximizing taste.\nType-C Rechargeable — Equipped with a built-in 900mAh battery and fast Type-C charging port, allowing you to recharge quickly and extend the device's life until the 36mL of e-liquid is fully used.\nHigh Capacity & Options → Pre-filled with 36mL of nic salt e-liquid, available in 2% or 5% nicotine strengths, making it perfect for both moderate and heavier vapers seeking long-lasting performance.\nUser-Friendly Design → Draw-activated, no buttons or screens needed for basic use  portable, and hassle-free with no refilling or coil changes required.",
    "flavors": "Here are the 10 available flavor combinations, each described in one sentence:\n\n1.DOUBLE APPLE ICE + STRAWBERRY DRAGONFRUIT: This pairing delivers a crisp, cooling double apple with icy menthol on one side, perfectly complemented by the exotic, sweet-tart burst of strawberry blended with juicy dragonfruit on the other.\n2.CHERRY COLA + WATERMELON ICE: Enjoy the fizzy, nostalgic taste of cherry-infused cola for a bold soda vibe, switchable to a refreshing chilled watermelon that explodes with summery sweetness and cool menthol.\n3.STRAWBERRY WATERMELON + COLA ICE: A juicy fusion of ripe strawberry and lush watermelon offers pure fruity bliss, while the alternate side chills things down with a sparkling cola enhanced by frosty ice.\n4.BLUEBERRY WATERMELON + STRAWBERRY MANGO: Tangy blueberry meets hydrating watermelon for a vibrant berry-melon harmony, paired with the tropical sweetness of strawberry and ripe mango for an irresistible sunny escape.\n5.BLUEBERRY ICE + KIWI PASSION FRUIT GUAVA: Cool, frosty blueberry provides a chilling tartness on one flavor, contrasting beautifully with the zesty tropical medley of kiwi, passion fruit, and guava on the other.\n6.STRAWBERRY RASPBERRY CHERRY ICE + GRAPE ICE: An icy triple berry blast of strawberry, raspberry, and cherry delivers sharp, frozen fruit intensity, switchable to a deep, chilling grape flavor with menthol undertones.\n7.RED BULL + BLUEBERRY WATERMELON: Energizing classic Red Bull taste brings a winged, caffeinated fizz, balanced by the soothing, juicy blend of blueberry and watermelon for a refreshing contrast.\n8.STRAWBERRY RASPBERRY CHERRY ICE + BLUEBERRY MINT: The icy mix of strawberry, raspberry, and cherry offers a frozen berry rush, while the other side cools further with tangy blueberry infused with crisp mint.\n9.TRIPLE MELON + PINEAPPLE COCONUT: A lush combination of three melons—watermelon, honeydew, and cantaloupe—creates ultimate melon freshness, paired with creamy pineapple and coconut for a piña colada-like tropical delight.\n10.GUMMY BEAR + RAINBOW CANDY: Classic gummy bear captures chewy, fruity candy nostalgia in every puff, switchable to a vibrant rainbow candy explosion of mixed sweet and tangy fruit flavors."
  },
  {
    "id": "VAAPEE_STAR_100K",
    "description": "Discover the Future of Vaping: VAAPEE STAR 100K\nElevate your vaping game with the revolutionary VAAPEE STAR 100K – the ultimate disposable vape delivering an astonishing big puffs of pure, uninterrupted bliss in a sleek, futuristic design.\nPowered by cutting-edge technology, this beast features a stunning 3D Curved Screen for crystal-clear visuals and intuitive control, AI Power Adjustment that intelligently optimizes performance based on your draw for consistent flavor and vapor every time, and advanced VPU (Vaping Processing Unit) inside for smoother taste, enhanced safety, and longer-lasting coils.\nChoose your intensity with two dynamic modes:\n\nPulse Power Mode: Delivers rhythmic bursts of energy for steady, flavorful hits and massive clouds with exceptional consistency.\nSuper Boost Mode: Cranks up the power for explosive vapor production, bolder flavors, and an adrenaline-pumping throat hit when you crave maximum intensity.\n\nRechargeable via Type-C, packed with premium e-liquid, and built for endurance – the VAAPEE STAR 100K redefines longevity, convenience, and innovation. Say goodbye to frequent replacements and hello to endless satisfaction!",
    "flavors": "Irresistible Flavor Lineup\nDive into 10 mouthwatering options, each crafted for explosive taste:\n\n1.Peach Ice: Juicy ripe peaches burst with sweetness, finished by a refreshing icy chill for the perfect cool summer vibe.\n2.Red Bull: Captures the iconic energizing fizz and winged rush of classic Red Bull, delivering an invigorating lift in every puff.\n3.Blue Razz Ice: Tangy blue raspberry explodes with bold tartness, cooled to perfection with a frosty menthol embrace.\n4.Double Apple Ice: Dual layers of crisp green and red apples blend seamlessly, enhanced by a double dose of icy freshness.\n5.Grape Ice: Deep, succulent purple grapes deliver rich sweetness, chilled with intense menthol for a grape escape on ice.\n6.Cherry Cola: Nostalgic fizzy cola infused with ripe cherry bursts, recreating the timeless soda fountain delight.\n7.Watermelon Ice: Luscious, hydrating watermelon slices meet a wave of cool ice for ultimate refreshing juiciness.\n8.Peach Mango Watermelon: Tropical trio of sweet peach, exotic mango, and juicy watermelon harmonize in a sunny fruit paradise.\n9.Blueberry Raspberry Cherry: Vibrant triple berry fusion of tangy blueberry, sharp raspberry, and sweet cherry for an irresistible berry blast.\n10.Mixed Berries: A symphony of premium strawberries, blueberries, raspberries, and blackberries in one perfectly balanced, juicy medley.\n\nReady to experience vaping like never before? Grab your VAAPEE STAR 100K today and unlock a world of flavor and power that lasts!"
  },
  {
    "id": "VAAPEE_X_30K",
    "description": "Unleash the Next Level: VAAPEE X 30K\nIntroducing the VAAPEE X 30K – the smartest, most intuitive disposable vape yet, engineered to deliver up to 30,000 puffs of premium flavor with effortless control and stunning visuals.\nExperience vaping redefined with a vibrant Smart LED Full Screen that displays battery life, puff count, and mode selection in real time, all navigated by smooth finger touch controls for seamless customization on the go. Choose from 4 powerful modes to perfectly match your vibe – from smooth and flavorful to intense cloud-chasing boosts.\nPowered by advanced dual mesh coil technology for richer taste, denser vapor, and longer-lasting performance, plus fast Type-C rechargeable convenience, the VAAPEE X 30K combines futuristic design with reliable, all-day power in one sleek package.\nNo buttons, no hassle – just touch, select, and enjoy an elevated vaping experience that puts you in complete control.",
    "flavors": "Explosive Flavor Collection\nIndulge in 10 expertly crafted flavors designed to thrill your taste buds:\n\n1.Blue Raspberry Ice: A bold rush of tangy blue raspberry swept away by an exhilarating wave of icy coolness.\n2.Fruit Gum: Nostalgic chewy fruit candy sweetness bursts with playful, juicy notes in every delightful puff.\n3.Double Apple: Crisp green and lush red apples unite for a perfectly balanced, refreshingly authentic double apple experience.\n4.Cola Ice: Classic fizzy cola sparkle meets a chilling menthol finish for the ultimate refreshing soda-inspired vape.\n5.Blueberry Ice: Plump, juicy blueberries deliver sweet-tart perfection, enhanced by a frosty menthol breeze.\n6.Kiwi Passion Fruit: Zesty kiwi and exotic passion fruit blend into a vibrant, tropical tango of tangy sweetness.\n7.Monster Drink: Captures the iconic energizing kick and signature citrus-fueled flavor of the legendary Monster energy drink.\n8.Pina Colada: Creamy pineapple and coconut swirl together for a smooth, vacation-in-a-puff tropical escape.\n9.Peach Ice: Succulent ripe peaches explode with natural sweetness, cooled to perfection with crisp menthol.\n10.Strawberry Watermelon: Sweet strawberries and juicy watermelon fuse into a timeless, hydrating summer fruit harmony.\n\nElevate your vape game today – touch the future with the VAAPEE X 30K. Innovation meets flavor like never before!"
  },
  {
    "id": "VAPANDA_4_IN_1_120K",
    "description": "Revolutionize Your Vape: VAPANDA 4 IN 1 120K\nMeet the VAPANDA 4 IN 1 120K – the ultimate all-in-one rechargeable disposable vape that packs four incredible flavors into a single powerful device, delivering an astonishing up to 120,000 puffs of endless variety and satisfaction.\nWith a sleek Smart LED Display to monitor battery and flavor selection, effortless draw-activated firing, and a long-lasting rechargeable battery via Type-C, this innovative beast lets you switch between four premium flavors anytime with just a simple twist or click – no need to carry multiple devices ever again.\nPerfect for flavor chasers who crave diversity, the VAPANDA 4 IN 1 120K combines convenience, massive longevity, and bold taste in one compact, stylish package. Variety has never felt this good!",
    "flavors": "Epic 4-in-1 Flavor Editions\nChoose your perfect quartet from 10 mouthwatering pre-loaded combinations:\n\n1.Strawberry Ice - Strawberry Raspberry Cherry - Blue Raspberry Ice - Strawberry Kiwi: Cool strawberry chill kicks off, followed by a tangy triple berry blast, icy blue raspberry rush, and finishes with sweet-tart strawberry kiwi harmony.\n2.Red Bull - Blue Razz Ice - Kiwi Passion Fruit Guava - Strawberry Watermelon: Energizing Red Bull fizz starts strong, then icy blue razz, tropical kiwi-passion-guava explosion, and juicy strawberry watermelon refreshment.\n3.Red Bull - Cherry Cola - Blueberry Ice - Black Dragon Ice: Winged Red Bull energy leads into fizzy cherry cola nostalgia, frosty blueberry sweetness, and mysterious cool black dragon fruit ice.\n4.Peach Ice - Grape Ice - Peach Mango Watermelon - Watermelon Ice: Chilled juicy peach opens, deep grape ice follows, tropical peach-mango-watermelon fusion delights, and pure watermelon chill closes.\n5.Strawberry Raspberry Cherry - Mixed Berries - Blue Raspberry Ice - Raspberry Watermelon: Vibrant strawberry-raspberry-cherry trio bursts first, lush mixed berry medley continues, icy blue raspberry hits, and tangy raspberry watermelon refreshes.\n6.Sour Apple Blueberry - Double Apple Ice - Apple Peach - Peach Ice: Tart sour apple meets sweet blueberry, crisp double apple ice cools, juicy apple-peach blend warms, and frosty peach ice finishes smooth.\n7.Blue Razz Lemonade - Lemon Lime - Grape Ice - Cherry Cola Ice: Zesty blue raspberry lemonade sparkles, citrus lemon-lime bite energizes, chilled grape sweetness flows, and icy cherry cola fizz excites.\n8.Tangerine Ice - Lemon Ice - Mango Ice - Strawberry Banana: Bright frosty tangerine awakens, sharp lemon ice refreshes, sweet chilled mango indulges, and creamy strawberry-banana smoothie comforts.\n9.Cola Ice - Blueberry Ice - Triple Melon - Strawberry Grape: Fizzy chilled cola starts classic, frosty blueberry follows, lush triple melon hydration surges, and sweet strawberry-grape fusion satisfies.\n10.Vanilla Cola - Pink Lemonade - Pineapple Orange - Mango Peach: Creamy vanilla cola nostalgia begins, tart-sweet pink lemonade brightens, zesty pineapple-orange tropical punch invigorates, and juicy mango-peach paradise ends perfectly.\n\nWhy settle for one flavor when you can have four? Grab the VAPANDA 4 IN 1 120K now and experience true vaping freedom – variety, power, and flavor that lasts!"
  },
  {
    "id": "VAPANDA_PRO_40K",
    "description": "Elevate Your Vibe: VAPANDA PRO 40K\nStep into the future with the VAPANDA PRO 40K – a premium rechargeable disposable vape that delivers up to 40,000 puffs of intense, long-lasting flavor in a sleek, high-tech masterpiece.\nFeaturing a stunning full-screen display for real-time monitoring of battery, puffs, and settings, intuitive finger touch function for effortless mode switching and control, 2 dynamic modes (smooth for flavor-focused sessions or boost for massive clouds), and ultra-fast Type-C rechargeable battery – this device puts power and precision right at your fingertips.\nInnovative design meets unstoppable performance: draw-activated, portable, and built to last, the VAPANDA PRO 40K is your ultimate companion for all-day vaping without compromise.",
    "flavors": "Mouthwatering Flavor Selection\nExplore 12 bold, expertly crafted flavors that explode with authenticity:\n\n1.STRAWBERRY RASPBERRY CHERRY: A vibrant triple berry explosion of sweet strawberries, tart raspberries, and juicy cherries for an irresistible fruity rush.\n2.RED BULL: The iconic energizing fizz and winged citrus kick of classic Red Bull, delivering an invigorating boost in every puff.\n3.BLUEBERRY ICE: Plump, tangy blueberries drenched in a wave of frosty menthol for cool, refreshing sweetness.\n4.KIWI PASSION FRUIT GUAVA: Zesty kiwi, exotic passion fruit, and juicy guava blend into a tropical paradise of vibrant tang and sweetness.\n5.PEACH MANGO WATERMELON: Succulent peach, ripe mango, and hydrating watermelon fuse for a sunny, juicy tropical fruit symphony.\n6.CHERRY COLA ICE: Nostalgic fizzy cherry cola sparkle chilled with icy menthol for the perfect cool soda vibe.\n7.STRAWBERRY WATERMELON: Classic sweet strawberries and lush watermelon combine for timeless, refreshing summer juiciness.\n8.WATERMELON ICE: Pure, mouthwatering watermelon slices enhanced by a chilling menthol breeze for ultimate hydration on ice.\n9.MIXED BERRIES: A harmonious medley of ripe strawberries, blueberries, raspberries, and more in one perfectly balanced berry bliss.\n10.BLUE RAZZ LEMONADE: Tangy blue raspberry swirled with zesty lemonade for a bold, thirst-quenching spark of flavor.\n11.GRAPE ICE: Deep, succulent purple grapes deliver rich sweetness, cooled intensely with frosty menthol.\n12.STRAWBERRY BANANA: Creamy ripe bananas meet sweet strawberries for a smooth, classic fruit smoothie experience in every draw.\n\nTouch the pro level – get your VAPANDA PRO 40K today and experience vaping redefined!"
  },
  {
    "id": "Vapanda_2_In_1_80K",
    "description": "Experience Double the Thrill: VAPANDA 2 IN 1 80K\nUnlock a world of variety with the VAPANDA 2 IN 1 80K – the revolutionary rechargeable disposable vape that packs two premium flavors into one sleek device, delivering an incredible up to 80,000 puffs of non-stop satisfaction.\nThanks to its innovative Dual-Tank System, you can effortlessly switch between two complementary flavors with a simple twist or click, while the vibrant OLED Smart Display keeps you informed with real-time battery, puff count, and power mode status. Customize your experience with Smart Power Modes for smooth, flavorful draws or intense cloud production, all powered by ultra-fast USB-C charging for minimal downtime.\nCompact, powerful, and built for flavor lovers who hate monotony – the VAPANDA 2 IN 1 80K turns every session into a dynamic dual-flavor adventure.",
    "flavors": "Unbeatable Dual-Flavor Combinations\nDiscover 10 expertly paired editions that double your delight:\n\n1.Red Bull + Blue Razz Ice: Kick off with the electrifying fizz and energy of classic Red Bull, then switch to a tangy blue raspberry blast chilled with refreshing ice.\n2.Blueberry Ice + Mixed Berries: Cool, frosty blueberry sweetness leads the way, seamlessly switching to a lush, harmonious explosion of ripe mixed berries.\n3.Double Apple + Peach Ice: Crisp layers of green and red apples deliver authentic double apple refreshment, paired perfectly with juicy peach cooled by icy menthol.\n4.Blueberry Watermelon + Strawberry Watermelon: Tangy blueberry meets hydrating watermelon first, then transitions to the timeless sweet fusion of strawberry and watermelon.\n5.Kiwi Passion Fruit Guava + Sour Apple Blueberry: Exotic tropical zest of kiwi, passion fruit, and guava bursts brightly, followed by a sharp, tangy sour apple and blueberry twist.\n6.Lemon Lime + Peach Ice: Zesty citrus sparkle of lemon and lime awakens the senses, complemented by the smooth, chilled sweetness of ripe peach ice.\n7.Blueberry Mint + Strawberry Raspberry Cherry: Refreshing blueberry infused with crisp mint cools you down, switching to an intense triple berry rush of strawberry, raspberry, and cherry.\n8.Peach Mango Watermelon + Watermelon Ice: Sunny tropical blend of peach, mango, and watermelon delights, then chills out with pure, icy watermelon freshness.\n9.Blue Razz Lemonade + Apple Peach: Tart blue raspberry lemonade quenches with bold sparkle, paired with the juicy harmony of crisp apple and sweet peach.\n10.Red Energy Ice + Cherry Cola: Invigorating chilled Red Bull-style energy drink starts strong, switching to nostalgic fizzy cherry cola for a classic soda kick.\n\nWhy choose one flavor when you can have two? Elevate your vape with the VAPANDA 2 IN 1 80K – double the flavor, double the fun!"
  },
  {
    "id": "Vapanda_Tornado_18K",
    "description": "Discover the Vapanda Tornado 18K: Power Meets Elegance\nElevate your vaping experience with the Vapanda Tornado 18K – a masterpiece of classic design blended with modern innovation. This sleek disposable vape boasts an enduring 18,000 puffs, powered by a rechargeable battery via Type-C fast charging for uninterrupted enjoyment. Its intuitive simple use requires no buttons or settings – just draw and savor. The built-in digital screen keeps you informed with real-time battery and e-liquid levels, ensuring you're always in control.\nCrafted for sophistication and convenience, the Vapanda Tornado 18K delivers rich, consistent flavor through advanced mesh coil technology. Whether you're a seasoned vaper or seeking effortless pleasure, this is your whirlwind of pure satisfaction.",
    "flavors": "Explore Our Exquisite Flavor Collection\n\n1.Watermelon Ice: A refreshing burst of juicy watermelon cooled by a crisp menthol finish, perfect for a revitalizing all-day vape.\n2.Strawberry Raspberry Cherry: A harmonious trio of ripe strawberries, tangy raspberries, and sweet cherries, delivering a vibrant berry medley in every puff.\n3.Gummy Bear: Nostalgic candy sweetness with fruity undertones, capturing the playful essence of your favorite chewy treats.\n4.Kiwi Passion Fruit Guava: An exotic tropical fusion where tangy kiwi meets passionate passion fruit and lush guava for a sunny, invigorating escape.\n5.Mixed Berries: A symphony of handpicked berries blending sweet and tart notes for a bold, multifaceted fruit explosion.\n6.Cranberry Grape: Tart cranberries intertwined with plump, juicy grapes, creating a sophisticated balance of sharp and sweet.\n7.Grape Ice: Intense grape richness chilled with icy menthol, offering a cool and satisfying grape experience.\n8.Strawberry Mango: Succulent strawberries paired with creamy tropical mango, evoking a smooth and indulgent fruit smoothie.\n9.Blueberry Ice: Plump blueberries infused with a frosty menthol kick, for a cool and boldly berry-forward vape.\n10.Blue Raspberry Ice: Zesty blue raspberry with an icy exhale, delivering tangy sweetness and refreshing chill.\n11.Blue Raspberry Lemonade: Tart blue raspberry mingled with fizzy lemonade, a sparkling summer classic in vapor form.\n12.Peach Ice: Juicy ripe peaches enveloped in cool menthol, for a sweetly chilled stone fruit delight.\n13.Cherry Cola: Fizzy cola infused with bold cherry, recreating the iconic soda with a vaping twist.\n14.Strawberry Ice Cream: Creamy vanilla ice cream swirled with fresh strawberries, indulging your senses in dessert heaven.\n15.Strawberry Watermelon: Sweet strawberries fused with hydrating watermelon, a timeless fruity harmony that's effortlessly refreshing.\n\nUnleash the storm – choose your flavor and let the Vapanda Tornado 18K sweep you away. Available now for the ultimate in style, simplicity, and satisfaction."
  },
  {
    "id": "Vapanda_Ultra_50K",
    "description": "Experience Luxury Like Never Before: Vapanda Ultra 50K\nIndulge in the pinnacle of vaping sophistication with the Vapanda Ultra 50K – where premium leather-wrapped design meets cutting-edge performance. This exquisite disposable vape delivers an astonishing 50,000 puffs, wrapped in luxurious leather for a tactile grip that feels as good as it looks. Stay fully informed with the expansive full side digital screen displaying real-time battery life, e-liquid levels, and puff count. Powered by a robust rechargeable battery with Type-C fast charging, it ensures you're never left waiting – quick top-ups for endless enjoyment.\nEngineered with dual mesh coil technology, the Vapanda Ultra 50K provides denser vapor, richer flavor consistency, and unparalleled smoothness from the first draw to the last. Perfect for the discerning vaper who demands elegance, endurance, and effortless power.",
    "flavors": "Discover Our Premium Flavor Lineup\n\n1.Strawberry Kiwi: A delightful fusion of ripe, juicy strawberries and tangy kiwi, creating a perfectly balanced sweet-tart tropical harmony in every puff.\n2.Strawberry Ice: Sweet, sun-ripened strawberries chilled with a refreshing menthol breeze, delivering a cool and invigorating fruity escape.\n3.Watermelon Ice: Succulent, hydrating watermelon infused with icy menthol, for a crisp and revitalizing burst of summer freshness.\n4.Strawberry Raspberry Cherry: An explosive berry trio of lush strawberries, tart raspberries, and bold cherries, blending into a vibrant, multi-layered fruit symphony.\n5.Red Bull: Energizing wings of the iconic energy drink flavor, with a fizzy, tangy kick that boosts your vape with exhilarating vitality.\n6.Sour Apple Blueberry: Zesty sour green apple tangled with sweet, plump blueberries, offering a thrilling puckery-sweet contrast that's boldly addictive.\n7.Mixed Berries: A masterful medley of assorted ripe berries, weaving together sweet, tart, and juicy notes for an authentic, all-day berry bliss.\n8.Blue Raspberry Ice: Tangy blue raspberry drenched in frosty menthol, providing a sharp, sweet chill that's refreshingly intense.\n9.Raspberry Watermelon: Juicy raspberries paired with refreshing watermelon, crafting a seamless blend of tart brightness and watery sweetness.\n10.Kiwi Passion Fruit Guava: Exotic tango of tangy kiwi, passionate passion fruit, and tropical guava, transporting you to a lush, sunny paradise with every inhale.\n\nElevate your vape game with the Vapanda Ultra 50K – luxury in your hand, power in every puff. Choose your flavor and embrace the ultimate vaping indulgence today."
  },
  {
    "id": "VAAPEE_Tornado_25K",
    "description": "Unleash the Storm: VAAPEE Tornado 25K\nStep into the next level of vaping power with the VAAPEE Tornado 25K – delivering more puffs and bigger capacity for longer-lasting satisfaction without compromise. Embracing the iconic Classic Tornado Style, this sleek disposable combines timeless design with modern performance. Stay charged and ready with Type-C fast charging, and keep full control thanks to the intuitive digital screen that displays real-time battery and e-liquid levels.\nPowered by advanced mesh coil technology, the Tornado 25K produces massive clouds and intense, consistent flavor from the very first puff to the impressive 25,000. It's the perfect blend of endurance, style, and effortless enjoyment for vapers who demand more.",
    "flavors": "Dive Into Our Irresistible Flavor Selection\n\n1.Kiwi Berry Mango: A tropical explosion of tangy kiwi, sweet mixed berries, and ripe mango, delivering a juicy, vibrant fusion that's pure sunshine in every draw.\n2.Blueberry Ice: Plump, juicy blueberries chilled with a crisp menthol wave, offering a refreshing and boldly fruity cool-down.\n3.Watermelon Ice: Hydrating slices of sweet watermelon finished with icy menthol, for a crisp, thirst-quenching burst of summer refreshment.\n4.Kiwi Passion Fruit Guava: An exotic paradise blend of zesty kiwi, tangy passion fruit, and lush guava, transporting you to tropical bliss with every inhale.\n5.Blue Raspberry Ice: Tangy blue raspberry swirled with frosty menthol, creating a sharp, sweet chill that's electrifyingly refreshing.\n6.Strawberry Raspberry Cherry: A dynamic berry trio of ripe strawberries, tart raspberries, and deep cherries, harmonizing into a rich, multi-layered fruit celebration.\n7.Blueberry Orange Gummy: Chewy gummy candy infused with sweet blueberries and zesty orange, capturing nostalgic sweetness with a citrus twist.\n8.Lemon Bubble Gum: Classic bubble gum bursting with bright, tangy lemon, for a playful, fizzy chew that's delightfully nostalgic.\n9.Cherry Cola: Bold cherry sweetness mixed with fizzy cola effervescence, recreating the iconic soda experience in smooth vapor form.\n10.Red Berries: A bold medley of ripe red berries blending tart and sweet notes, delivering an intense, authentic berry rush.\n11.Strawberry Watermelon: Juicy strawberries perfectly paired with refreshing watermelon, creating a timeless, hydrating fruit harmony that's simply irresistible.\n12.Peach Ice: Succulent ripe peaches enveloped in cool menthol, for a sweetly chilled stone fruit experience that's pure indulgence.\n\nPower up your vape life with the VAAPEE Tornado 25K – more puffs, more flavor, more everything. Choose your storm today and let the flavors whirl!"
  },
  {
    "id": "VAPLIQ_e_liquid",
    "description": "Discover Premium Vaping: VAPLIQ E-Liquid\nExperience smooth, satisfying vaping with VAPLIQ E-Liquid – expertly crafted for perfection in every bottle. Each 10ml capacity bottle delivers a potent 20mg nicotine salt hit for quick, crave-killing satisfaction with a silky throat feel. Fully TPD approved for your peace of mind, and balanced with a 50:50 PG/VG ratio for outstanding flavor delivery, dense clouds, and ideal performance in pod systems and starter kits.\nWhether you're chasing icy refreshment, fruity explosions, or nostalgic sweets, VAPLIQ offers pure, consistent taste from the first drop to the last. Elevate your daily vape with quality you can trust.",
    "flavors": "Explore Our Mouthwatering Flavor Range\n\n1.Blue Razz Ice: Tangy blue raspberry blasted with frosty menthol, delivering a sharp, sweet chill that's refreshingly addictive.\n2.Blueberry Ice: Juicy, ripe blueberries cooled by icy menthol, for a bold and invigorating fruity freeze.\n3.Grape Ice: Rich, plump grapes infused with crisp menthol, offering a cool and intensely satisfying grape escape.\n4.Gummy Bear: Classic chewy candy sweetness packed with playful fruity notes, capturing nostalgic joy in every puff.\n5.Mixed Berries: A vibrant blend of handpicked berries, balancing sweet and tart for an authentic, all-day berry delight.\n6.Straw Raspberry Cherry: Lush strawberries, tangy raspberries, and bold cherries in a dynamic trio that bursts with layered fruit harmony.\n7.Strawberry Ice: Sun-ripened strawberries chilled with refreshing menthol, creating a cool and sweetly satisfying vape.\n8.Strawberry Kiwi: Sweet strawberries paired with zesty kiwi, for a perfectly balanced sweet-tart tropical duet.\n9.Strawberry Watermelon: Juicy strawberries fused with hydrating watermelon, delivering timeless, refreshing fruity bliss.\n10.Watermelon Ice: Succulent watermelon slices finished with icy menthol, for a crisp and thirst-quenching summer sensation.\n11.Kiwi Passion Fruit Guava: Exotic fusion of tangy kiwi, passionate passion fruit, and lush guava, transporting you to tropical paradise.\n12.Cherry Cola: Bold cherry sweetness mixed with fizzy cola sparkle, recreating the iconic soda in smooth, flavorful vapor.\n13.Double Apple Ice: Crisp green and red apples doubled up and chilled with menthol, for a refreshingly sharp fruit experience.\n14.Triple Mango: Three layers of ripe, juicy mango intensity, delivering an overwhelmingly tropical and indulgent sweetness.\n15.Peach Mango Pineapple: Golden peaches tangled with sweet mango and tangy pineapple, crafting a sunny, multi-fruit tropical getaway.\n16.Kiwi Berry Mango: Tangy kiwi blended with mixed berries and creamy mango, for a vibrant and juicy tropical berry explosion.\n17.Peach Ice: Ripe, succulent peaches enveloped in cool menthol, offering a sweetly chilled stone fruit indulgence.\n18.Blueberry Cranberry Grape: Plump blueberries, tart cranberries, and juicy grapes in a sophisticated, multi-layered berry-grape symphony.\n19.Blue Razz Lemonade: Zesty blue raspberry swirled with fizzy lemonade, for a sparkling, tangy-sweet summer classic.\n20.Strawberry Banana: Creamy banana smoothed with ripe strawberries, creating a rich and comforting fruit smoothie vibe.\n\nUnlock pure flavor freedom with VAPLIQ E-Liquid – premium quality, endless variety. Pick your favorite and vape the difference today!"
  }
]